In [3]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [4]:
df=pd.DataFrame({
    'color': ['red', 'blue', 'green', 'blue', 'red']})

In [6]:
df.head()

   color
0    red
1   blue
2  green
3   blue
4    red

In [7]:
encoder =OneHotEncoder()
encnoded=

encoder.fit_transform(df[['color']]).toarray()

SyntaxError: invalid syntax (4170436302.py, line 2)

In [8]:
## label encoding
df.head()

   color
0    red
1   blue
2  green
3   blue
4    red

In [9]:
from sklearn.preprocessing import LabelEncoder
lbl=LabelEncoder()

In [10]:
lbl.fit_transform(df['color'])

array([2, 0, 1, 0, 2])

In [11]:
lbl.transform(['red', 'blue', 'green'])

array([2, 0, 1])

In [12]:
##ordinal encoding
from sklearn.preprocessing import OrdinalEncoder

In [14]:
##create a instance of the OrdinalEncoder
ord=OrdinalEncoder(categories=[['red', 'green', 'blue']])
##fit the encoder to the data
ord.fit_transform(df[['color']])

array([[0.],
       [2.],
       [1.],
       [2.],
       [0.]])

In [16]:
## target guided ordinal encoding
df=pd.DataFrame({
      'city':['New york','London','Paris','Tokyo','New york'],
      'price':[100,200,300,400,500]})

In [17]:
df

       city  price
0  New york    100
1    London    200
2     Paris    300
3     Tokyo    400
4  New york    500

In [19]:
mean_price=df.groupby('city')['price'].mean()

In [20]:
mean_price

city
London      200.0
New york    300.0
Paris       300.0
Tokyo       400.0
Name: price, dtype: float64

In [21]:
df['city_encoded']=df['city'].map(mean_price)

In [22]:
df

       city  price  city_encoded
0  New york    100         300.0
1    London    200         200.0
2     Paris    300         300.0
3     Tokyo    400         400.0
4  New york    500         300.0

In [23]:
df[['price','city_encoded']]

   price  city_encoded
0    100         300.0
1    200         200.0
2    300         300.0
3    400         400.0
4    500         300.0

In [24]:
import seaborn as sns
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [25]:
from sklearn.preprocessing import LabelEncoder
tips=sns.load_dataset('tips')
label_encoder=LabelEncoder()
tips['time_encoded']=label_encoder.fit_transform(tips['time'])
time_total_bill=tips.groupby('time_encoded')['total_bill'].mean()
print(time_total_bill)

time_encoded
0    20.797159
1    17.168676
Name: total_bill, dtype: float64